Repository: abenari/foreman-docker
Catalog: locale/*/foreman_docker.po
Languages: it, ru

source: List all containers
it: Elenca tutti i container
ru: Показать все контейнеры

source: List all containers in a compute resource
it: Elenca tutti i container in una risorsa di calcolo
ru: Список всех контейнеров вычислительного ресурса

source: Show a container
it: Mostra un container
ru: Показать контейнер

source: Show container in a compute resource
it: Mostra un container in una risorsa di calcolo
ru: Показать контейнер на вычислительном ресурсе

source: Create a container
it: Crea un container
ru: Создать контейнер

source: Create container in a compute resource
it: Crea un container in una risorsa di calcolo
ru: Создать контейнер на вычислительном ресурсе

source: Wrong attributes: %s
it: Attributi non corretti: %s
ru: Неверные атрибуты: %s

source: Delete a container
it: Rimuovi un container
ru: Удалить контейнер

source: Delete container in a compute resource
it: Rimuovi container in una risorsa di calcolo
ru: Удалить контейнер с вычислительного ресурса

source: Show container logs
it: Mostra i log di un container
ru: Показать журналы контейнера

source: Show logs from a container in a compute resource
it: Mostra i log di un container in una risorsa di calcolo
ru: Показать журналы из контейнера вычислительного ресурса

source: Number of lines to tail. Default: 100
it: Numero di righe per il comando tail. Predefinito: 100
ru: Число строк в буфере прокрутки (по умолчанию 100)

source: Run power operation on a container
it: Eseguire una operazione di gestione dell'alimentazione su un container
ru: Выполнить операцию управления питанием для контейнера

source: Run power operation on a container in a compute resource
it: Eseguire una operazione di gestione dell'alimentazione su un container in una risorsa di calcolo
ru: Выполнить операцию управления питанием для контейнера в вычислительном ресурсе

source: power action, valid actions are (start), (stop), (status)
it: azione di gestione dell'alimentazione, azioni valide sono (start), (stop), (status)
ru: операция управления питанием: (start), (stop), (status)

source: Unknown method: available power operations are %s
it: Metodo sconosciuto: le operazioni di alimentazione disponibili sono %s
ru: Неизвестный метод. Доступные операции: %s

source: Container %s is being deleted.
it: Il container %s è stato cancellato.
ru: Удаление контейнера %s...

source: Failed to commit %{container}: %{e}
it: Impossibile eseguire il commit di %{container}: %{e}
ru: Не удалось сохранить %{container}: %{e}

source: %{vm} is now %{vm_state}
it: %{vm} è ora %{vm_state}
ru: %{vm} %{vm_state}

source: failed to %{action} %{vm}
it: impossibile %{action} %{vm}
ru: не удалось выполнить действие «%{action}» над %{vm}

source: Error - %{message}
it: Errore - %{message}
ru: Ошибка: %{message}

source: An error occured during repository search: '%s'
it: Si è verificato un errore durante la ricerca del repository: '%s'
ru: Произошла ошибка при поиске репозиториев: «%s».

source: Registry
it: Registro
ru: Реестр

source: Select a registry
it: Seleziona un registro
ru: Выберите реестр

source: Commit
ru: Сохранить

source: Delete %s?
it: Cancella %s?
ru: Удалить %s?

source: Are you sure you want to power %{act} %{vm}?
it: Sei sicuro di voler attivare %{act} %{vm}?
ru: Вы действительно хотите %{act} %{vm}?

source: %{cores} Cores and %{memory} memory
it: %{cores} Core e %{memory} di memoria
ru: Ядра: %{cores}, память: %{memory}

source: Docker/Container
ru: Docker/Контейнер

source: Docker/Registry
ru: Docker/Реестр

source: Error creating communicating with Docker. Check the Foreman logs: %s
it: Errore nella comunicazione con Docker. Controllare i log di Foreman: %s
ru: Не удалось связаться с Docker. Проверьте журналы Foreman: %s

source: e.g. https://docker.example.com:4243 or unix:///var/run/docker.sock
ru: например: https://docker.example.com:4243 or unix:///var/run/docker.sock

source: Test Connection
it: Connessione test
ru: Проверка соединения

source: Image
it: Immagine
ru: Образ

source: Cores
it: Core
ru: Ядра

source: Memory
it: Memoria
ru: Память

source: Command
it: Comando
ru: Команда

source: Power ON this machine
it: Attiva questa macchina
ru: Включить машину

source: Start
it: Inizio
ru: Начало

source: Name
it: Nome
ru: Имя

source: CPUs
it: CPU
ru: CPU

source: Status
it: Stato
ru: Статус

source: Power
it: Alimentazione
ru: Питание

source: Properties
it: Proprietà
ru: Свойства

source: IP Address
it: Indirizzo IP
ru: IP

source: CPU shares
it: Condivisioni CPU
ru: Доля CPU

source: Exposed ports
it: Porte esposte
ru: Открытые порты

source: Running on
it: In esecuzione su
ru: Выполняется на

source: Uptime
ru: Время работы

source: Managed
it: Gestito
ru: Управление

source: Yes
it: Si
ru: Да

source: No
ru: Нет

source: Containers
it: Container
ru: Контейнеры

source: New container
it: Nuovo container
ru: Новый контейнер

source: Error connecting with the compute resource: <strong> %s </strong>
it: Errore durante il collegamento con la risorsa del computer: <strong> %s </strong>
ru: Ошибка подключения к ресурсу: <strong> %s </strong>

source: Image Repository
it: Repository immagine
ru: Репозиторий образов

source: Image Tag
it: Tag immagine
ru: Тег образа

source: Environment Variables
it: Variabili dell'ambiente
ru: Переменные окружения

source: Processes
it: Processi
ru: Процессы

source: Logs
it: Log
ru: Журналы

source: Notice
it: Avviso
ru: Примечание

source: Your container is stopped.
it: Il container è stato arrestato.
ru: Контейнер остановлен.

source: Please turn on your container to see processes running, logs, and more.
it: Attivare il container per visualizzare i processi in esecuzione, log e altro.
ru: Включите контейнер для просмотра процессов, журналов и т.п.

source: Commit this container state
it: Esegui il commit dello stato di questo container
ru: Сохранить состояние контейнера

source: Repo
ru: Репозиторий

source: Tag
it: Etichetta
ru: Тег

source: latest
it: ultimissimo
ru: последний

source: Author
it: Autore
ru: Автор

source: Foreman user <foremaner@theforeman.org>
it: Utente di Foreman <foremaner@theforeman.org>
ru: Пользователь Foreman <foremaner@theforeman.org>

source: Comment
it: Commento
ru: Комментарий

source: Description of the commit
it: Descrizione del commit
ru: Описание сохраняемой копии

source: Cancel
it: Annulla
ru: Отмена

source: Submit
it: Invia
ru: Отправить

source: Back
it: Indietro
ru: Назад

source: Next
it: Avanti
ru: Вперед

source: Search
it: Cerca
ru: Поиск

source: Find your favorite container, e.g: centos
it: Trova il container desiderato, es. centos
ru: Найдите интересующий контейнер (например, centos)

source: Basic options
it: Opzioni di base
ru: Основные параметры

source: Compute options
it: Opzioni di calcolo
ru: Вычислительные параметры

source: CPU sets
it: Insiemi della CPU
ru: Список CPU

source: learn more about CPU sets
it: maggiori informazioni sugli insiemi della CPU
ru: узнать больше

source: learn more about CPU shares
it: maggiori informazioni sulle condivisioni della CPU
ru: узнать больше

source: Shell
ru: Оболочка

source: Allocate a pseudo-tty
it: Allocare un pseudo-tty
ru: Выделить псевдо-TTY

source: Attach STDIN
it: Assegnare STDIN
ru: STDIN

source: Attach STDOUT
it: Assegnare STDOUT
ru: STDOUT

source: Attach STDERR
it: Assegnare STDERR
ru: STDERR

source: Environment variables
it: Variabili dell'ambiente
ru: Переменные окружения

source: External registry
it: Registro esterno
ru: Внешний реестр

source: Compute resource
it: Risorsa di calcolo
ru: Ресурс

source: Resource selection
it: Selezione risorsa
ru: Выбор ресурса

source: Where do you want to deploy your container?:
it: Dove desideri implementare il container?
ru: Выберите ресурс, где будет создан контейнер

source: Deploy on
it: Implementare su
ru: Ресурс

source: You need a Docker compute resource in order to create containers. Please %s and try again.
it: Per creare un container è necessario avere una risorsa di calcolo del Docker. %s e riprovare.
ru: Для создания контейнера требуется ресурс Docker. %s

source: Name, e.g: PING_HOST
it: Nome, es: PING_HOST
ru: Имя (например, PING_HOST)

source: Value, e.g: theforeman.org
it: Valore, es: theforeman.org
ru: Значение (например, theforeman.org)

source: Add environment variable
it: Aggiungi variabile dell'ambiente
ru: Добавить переменную

source: The user that is used to ssh into the instance, normally docker-user, ubuntu, root etc
it: L'utente usato per una operazione ssh in una istanza, normalmente docker-user, ubuntu, root ecc
ru: Пользователь, устанавливающий SSH-соединение с экземпляром (docker-user, ubuntu, root и т.п.)

source: Password to authenticate with - used for SSH finish step.
it: Password per un'autenticazione con -used per la fase finale di SSH.
ru: Пароль SSH

source: Does this image support user data input?
it: Questa immagine supporta l'input dei dati utente?
ru: Допускает ли этот образ ввод пользовательских данных?

source: Locations
it: Posizioni
ru: Участки

source: Organizations
it: Organizzazioni
ru: Организации

source: Username used to access the registry
it: Nome utente usato per accedere al registro
ru: Имя пользователя для доступа к реестру

source: Password used for authentication to the registry
it: Password usata per l'autenticazione per il registro
ru: Пароль доступа к реестру

source: Edit Registry
it: Modifica registro
ru: Изменение реестра

source: Registries
it: Registri
ru: Реестры

source: New Registry
it: Nuovo registro
ru: Добавить

source: Url
ru: Адрес

source: Description
it: Descrizione
ru: Описание

source: All containers
it: Tutti i container
ru: Все контейнеры
